In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([['이겨레',25,'남',185,89],
                   ['조약돌',19,'여',163,53]],
                   columns=['성명','나이','성별','키','체중']
                  )
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [3]:
a = df['성명']
a

0    이겨레
1    조약돌
Name: 성명, dtype: object

In [4]:
df.나이

0    25
1    19
Name: 나이, dtype: int64

In [5]:
df.성별

0    남
1    여
Name: 성별, dtype: object

In [6]:
df = pd.DataFrame([['이겨레',25,'남',185,89],
                   ['조약돌',19,'여',163,53]],
                   columns=['성명','나이','성별','키','체중']
                  )
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [7]:
df[['성명','키','체중']]

    성명    키  체중
0  이겨레  185  89
1  조약돌  163  53

In [8]:
df[['나이']]

   나이
0  25
1  19

In [9]:
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

### 열 추가

In [10]:
df['BMI']=0

In [11]:
df

    성명  나이 성별    키  체중  BMI
0  이겨레  25  남  185  89    0
1  조약돌  19  여  163  53    0

### 행 추가

In [12]:
df.loc[2] = 0
df

    성명  나이 성별    키  체중  BMI
0  이겨레  25  남  185  89    0
1  조약돌  19  여  163  53    0
2    0   0  0    0   0    0

In [14]:
df.loc[3] = ['강산애',27,'남',177,63,40]
df

    성명  나이 성별    키  체중  BMI
0  이겨레  25  남  185  89    0
1  조약돌  19  여  163  53    0
2    0   0  0    0   0    0
3  강산애  27  남  177  63   40

### 열 -> 행으로 바꿔주기

In [38]:
# set_index('바꿔줄 열', inplace=True)
df = pd.DataFrame([['이겨레',25,'남',185,89],
                   ['조약돌',19,'여',163,53]],
                   columns=['성명','나이','성별','키','체중']
                  )
df.set_index('성명',inplace=True)
print(df.iloc[0,2])

185

In [34]:
df = pd.DataFrame([['이겨레',25,'남',185,89],
                   ['조약돌',19,'여',163,53]],
                   columns=['성명','나이','성별','키','체중']
                  )
df.set_index('성명',inplace=True)
print(df.loc['이겨레',['키','체중']])

키     185
체중     89
Name: 이겨레, dtype: object

In [51]:
df = pd.DataFrame([['이겨레',25,'남',185,89],
                   ['조약돌',19,'여',163,53]],
                   columns=['성명','나이','성별','키','체중']
                  )
df.set_index('성명',inplace=True)
print(df.loc[['이겨레','조약돌'],['키','체중']]) # [행],[열]
print('\n')
print(df.iloc[[0,1],[2,3]]) # [행],[열]
print('\n')
print(df.columns[0]) # 성명을 행으로 뺏으므로 열 0번은 나이 이다.

       키  체중
성명
이겨레  185  89
조약돌  163  53


       키  체중
성명
이겨레  185  89
조약돌  163  53


나이

In [62]:
df = pd.DataFrame([['이겨레', 25, '남', 185, 89], ['조약돌', 19, '여', 163, 53]],
                  columns=['성명', '나이', '성별', '키', '체중'])
df.set_index('성명', inplace=True)
df['BMI'] = 0
df.loc['이겨레', 'BMI'] = 26.00
df.iloc[1, 4] = 19.95
df

     나이 성별    키  체중    BMI
성명
이겨레  25  남  185  89  26.00
조약돌  19  여  163  53  19.95

In [65]:
df = pd.DataFrame([['이겨레', 25, '남', 185, 89], ['조약돌', 19, '여', 163, 53]],
                  columns=['성명', '나이', '성별', '키', '체중'])
df.set_index('성명', inplace=True)
df.loc['강산애','나이':'체중'] = 27,'남',177,63 # [행],[열 전부]
df

       나이 성별      키    체중
성명
이겨레  25.0  남  185.0  89.0
조약돌  19.0  여  163.0  53.0
강산애  27.0  남  177.0  63.0